NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32ZG23/EFR32ZG23A010F512GM40.svd
        <register>
          <name>RXCTRL</name>
          <description>No Description</description>
          <addressOffset>0x04C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>STORECRC</name>
              <description>Store CRC value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCEPTCRCERRORS</name>
              <description>Accept CRC Errors.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REJECT</name>
                  <description>Frames with one or more detected CRC errors will be cleared from the receiver buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCEPT</name>
                  <description>Frames will always be written to the receive buffer, regardless of CRC errors.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCEPTBLOCKERRORS</name>
              <description>Accept Block Decoding Errors.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REJECT</name>
                  <description>Frame reception will be stopped when a block decoding error is found.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCEPT</name>
                  <description>Frame reception will continue even in the case of a block decoding error.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRACKABFRAME</name>
              <description>Track Aborted RX Frame</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>When a frame abort is triggered, the frame reception is immediately aborted, the RXABORTED interrupt flag is set,  and the receiver may start searching for a new frame. </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>When a frame abort is triggered, the receiver is still enabled for the duration of the frame (as defined by  the frame length), but no data output is generated. Only when the complete frame is received, the RXABORTED interrupt  flag is set and a new frame reception may begin. This mode may, for instance, be used to avoid finding a new  FRAMEDET event inside the payload data of a discarded frame. </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUFCLEAR</name>
              <description>Buffer Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFRESTOREFRAMEERROR</name>
              <description>Buffer restore on frame error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFRESTORERXABORTED</name>
              <description>Buffer restore on RXABORTED</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFRAMEENDAHEADBYTES</name>
              <description>RX frame almost end of packet timing</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCEPTUARTERRORS</name>
              <description>Accept UART Start/Stop bit Errors.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRAILTXDATACTRL</name>
          <description>No Description</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>TRAILTXDATA</name>
              <description>Trailing Data value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRAILTXDATACNT</name>
              <description>Trailing data bit count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRAILTXDATAFORCE</name>
              <description>Force trailing TX data insertion</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Trailing data in transmit is only applied in order to   fill up an integer number of block coding and interleaver buffers.   If block coding and interleaving is not used, no trailing data  is transmitted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>The number of bits defined by TRAILTXDATACNT is always  appended to the transmit data, in addition to the necessary  bits to fill up an integer number of block coding and interleaver buffers.  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRAILTXREPLEN</name>
              <description>Trailing Data Repeat Length</description>
              <bitOffset>12</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSUPPLENOVERIDE</name>
              <description>TX Sup Len Override</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POSTAMBLEEN</name>
              <description>WMBUS T mode postamble enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRAILRXDATA</name>
          <description>No Description</description>
          <addressOffset>0x054</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>RSSI</name>
              <description>Append RSSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCOK</name>
              <description>Append CRC OK Indicator</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROTIMERCC0BASE</name>
              <description>PROTIMER Capture Compare channel 0 Base</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROTIMERCC0WRAPL</name>
              <description>PROTIMER Capture Compare channel 0 WrapL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROTIMERCC0WRAPH</name>
              <description>PROTIMER Capture Compare channel 0 WrapH</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCSTAMP</name>
              <description>RTCC Time Stamp</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCNT</name>
          <description>No Description</description>
          <addressOffset>0x058</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>SCNT</name>
              <description>Sub-Frame Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONVGENERATOR</name>
          <description>No Description</description>
          <addressOffset>0x05C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00037F7F</resetMask>
          <fields>
            <field>
              <name>GENERATOR0</name>
              <description>Output 0 Generator Polynomial</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GENERATOR1</name>
              <description>Output 1 Generator Polynomial</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECURSIVE</name>
              <description>Convolutional encoding</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>Non-recursive convolutional coding is used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>Recursive convolutional coding is used</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NONSYSTEMATIC</name>
              <description>Non systematic recursive code</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>X0</name>
                  <description>The recursive code is systematic</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>X1</name>
                  <description>The recursive code is not systematic</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUNCTCTRL</name>
          <description>No Description</description>
          <addressOffset>0x060</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000101</resetValue>
          <resetMask>0x00007F7F</resetMask>
          <fields>
            <field>
              <name>PUNCT0</name>
              <description>Puncturing Matrix Row for Output 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUNCT1</name>
              <description>Puncturing Matrix Row for Output 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAUSECTRL</name>
          <description>No Description</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFF83F</resetMask>
          <fields>
            <field>
              <name>FRAMEDETPAUSEEN</name>
              <description>Frame detect pause enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXINTERLEAVEWRITEPAUSEEN</name>
              <description>Transmit interleaver write pause enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXINTERLEAVEWRITEPAUSEEN</name>
              <description>Receive interleaver write pause enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERLEAVEREADPAUSEEN</name>
              <description>Interleaver read pause enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSUBFRAMEPAUSEEN</name>
              <description>Transmit subframe pause enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXWCNTMATCHPAUSEEN</name>
              <description>Receive wcnt match pause enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONVPAUSECNT</name>
              <description>Convolutional decoder pause setting</description>
              <bitOffset>11</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERLEAVEWRITEPAUSECNT</name>
              <description>Interleaver write pause count</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERLEAVEREADPAUSECNT</name>
              <description>Interleaver read pause count</description>
              <bitOffset>22</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
